uhnp/src/Catalogs/ЭтапыУниверсальныхПроцессов/ЭтапыУниверсальныхПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыУниверсальныхПроцессов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ШаблоныУниверсальныхПроцессов</owners>
  <attributes>
    <name>УсловияСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочернийМаршрут</name>
    <type>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДочернимМаршрутом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеУтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйПереход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеСогласованиеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеОтклонениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипыЭтаповУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>УтверждающиеИмеютПравоРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОрганизацийЭтапа</name>
    <type>
      <types>EnumRef.ТипыОрганизационныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийУтвержденияЭтапа</name>
    <type>
      <types>EnumRef.КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПоРасписанию</name>
    <type>
      <types>EnumRef.ДействияЭтапаПоРасписанию</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеАвтоматическогоВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационныеЕдиницыОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласованияОбъекта</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СтатусыПоказателей</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СтатусыТранзакций</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
      <types>EnumRef</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУтверждениеЭтапа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДоступностиРеквизитов</name>
    <type>
      <types>CatalogRef.СхемаДоступностиРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автоутверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НайденыОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриСогласовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательныйКомментарийПриОтклонении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизационныеЕдиницыОтбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАвтоматическиеДействия</name>
    <type>
      <types>EnumRef.УдалитьАвтоматическиеДействияЭтапаПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПараметры</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияУсловийОтборов</name>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормируемыеДокументы</name>
    <attributes>
      <name>ДокументБД</name>
      <type>
        <types>CatalogRef.ДокументыБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>DefinedType.ШаблонДокументаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрольный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОбязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовЭтапа</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика1</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика2</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАналитика3</name>
      <type>
        <types>EnumRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПредшественники</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыДляОтклонения</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияПараметров</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтбораПараметра</name>
      <type>
        <types>String</types>
        <types>EnumRef.СпособыВычисленияПараметровОперандов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметраДоТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеСписка</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПерехода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникСсылка</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Утверждающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РасширеннаяАдресацияСогласования</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАдресации</name>
      <type>
        <types>EnumRef.СпособыАдресацииСогласования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ЗначенияАналитикОбъектов/ЗначенияАналитикОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАналитикОбъектов</name>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонДокумента</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности/КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности</name>
  <enumValues>
    <name>УтвержденыВсеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УтвержденыКонтрольныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУтвержденыЭкземплярыОтчетовИзРеестра</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУтвержденыЗаполненныеЭкземплярыОтчетов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ДействияЭтапа/ДействияЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияЭтапа</name>
  <enumValues>
    <name>ПерейтиКЭтапу</name>
  </enumValues>
  <enumValues>
    <name>УтвердитьОтчет</name>
  </enumValues>
  <enumValues>
    <name>ВернутьИсполнителю</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ЭтапыУниверсальныхПроцессов/Forms/ФормаЭтапаПроцессаПодготовкиОтчетности/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Считаем расписание
	Расписание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "РасписаниеАвтоматическогоВыполнения").Получить();
	ОбработатьИзменениеРасписания(Расписание);
	
	ЗаполнитьАналитики();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Считаем отборы организаций
	СхемаКомпоновкиДанных = Справочники.ЭтапыУниверсальныхПроцессов.ПолучитьМакет("ОтборОрганизационныхЕдиниц");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ОрганизационныеЕдиницыОтборСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	
	Если Объект.Ссылка.Пустая() Тогда
		НастройкиСКД = Неопределено;
	Иначе
		НастройкиСКД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ОрганизационныеЕдиницыОтбор").Получить();
	КонецЕсли;
	Если НастройкиСКД = Неопределено Тогда
		НастройкиСКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	ОрганизационныеЕдиницыОтборСКД.ЗагрузитьНастройки(НастройкиСКД);
	
	ИнициализацияУсловийСогласования();
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.КритерийУтвержденияЭтапа = Перечисления.КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности.УтвержденыВсеДокументы;
	КонецЕсли;
	
	// Отображение элементов формы
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ВосстановитьНастройкиТаблицыИзВременногоХранилища(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Сохранение условия согласования
	ТекущийОбъект.УсловияСогласования = Новый ХранилищеЗначения(РеквизитФормыВЗначение("ТабличноеПолеПерехода"));
	
	// Сохранение отборов организации
	ТекущийОбъект.ОрганизационныеЕдиницыОтбор = Новый ХранилищеЗначения(ОрганизационныеЕдиницыОтборСКД.ПолучитьНастройки());
	
	// Сохранение расписания
	Если РасписаниеИзменено Тогда
		Если ПустаяСтрока(АдресХранилищаРасписания) Тогда
			ТекущийОбъект.РасписаниеАвтоматическогоВыполнения = Неопределено; 
			Расписание = Неопределено;
		Иначе
			Расписание = ПолучитьИзВременногоХранилища(АдресХранилищаРасписания);
			ТекущийОбъект.РасписаниеАвтоматическогоВыполнения = Новый ХранилищеЗначения(Расписание);
		КонецЕсли;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзмененоРасписание", Истина);
		РасписаниеИзменено = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьОтчет", , Объект.Владелец);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ЭтапыУниверсальныхПроцессов.ОбновитьЭтапыПредшественники(ТекущийОбъект.Ссылка, ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ТабличноеПолеПерехода")));
	ЗаполнитьАналитики();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияУсловийСогласования()
	
	Если НЕ Параметры.Ключ.Пустая() Тогда 
		
		// Если этап уже сохранялся, то прочитаем настройки перехода из реквизита.
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		СохраненныеУсловия = ТекОбъект.УсловияСогласования.Получить();
		
		// Проверим наличие необходимых колонок в дереве.
		Если ТипЗнч(СохраненныеУсловия) = Тип("ДеревоЗначений") Тогда
			Если СохраненныеУсловия.Колонки.Найти("ИмяТипа") = Неопределено Тогда
				СохраненныеУсловия.Колонки.Добавить("ИмяТипа");
			КонецЕсли;
			Если СохраненныеУсловия.Колонки.Найти("ИдентификаторПерехода") = Неопределено Тогда
				СохраненныеУсловия.Колонки.Добавить("ИдентификаторПерехода");
			КонецЕсли;
			Если СохраненныеУсловия.Колонки.Найти("ИсточникСсылка") = Неопределено Тогда
				СохраненныеУсловия.Колонки.Добавить("ИсточникСсылка");
			КонецЕсли;
			Если СохраненныеУсловия.Колонки.Найти("Значение") = Неопределено Тогда
				СохраненныеУсловия.Колонки.Добавить("Значение");
			КонецЕсли;
		КонецЕсли;
		
		// Считаем дерево
		Если СохраненныеУсловия <> Неопределено Тогда
			ЗначениеВРеквизитФормы(СохраненныеУсловия, "ТабличноеПолеПерехода");
		КонецЕсли;
		
	КонецЕсли;
	
	СписокВыбораДействий.Очистить();
	СписокВыбораУсловий.Очистить();
	СписокВыбораДействий.Добавить(Перечисления.ДействияЭтапа.ПерейтиКЭтапу);
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОткрытьНастройкуУсловногоПерехода(Команда)
	
	Перем АдресДеревоОтборов, АдресТабличноеПолеПереходов, АдресКэшВидовСубконто, ОбычныйЭтап, АдресТаблицаДоступныхПараметров;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресДеревоОтборов", АдресДеревоОтборов);
	ПараметрыОткрытия.Вставить("АдресТабличноеПолеПереходов", АдресТабличноеПолеПереходов);
	ПараметрыОткрытия.Вставить("АдресКэшВидовСубконто", АдресКэшВидовСубконто);
	ПараметрыОткрытия.Вставить("ОбычныйЭтап", ОбычныйЭтап);
	ПараметрыОткрытия.Вставить("СписокВыбораУсловий", СписокВыбораУсловий);
	ПараметрыОткрытия.Вставить("СписокВыбораДействий", СписокВыбораДействий);
	ПараметрыОткрытия.Вставить("ШаблонПроцесса", Объект.Владелец);
	
	СохранитьТаблицыВоВременномХранилище(АдресДеревоОтборов, АдресТабличноеПолеПереходов, АдресКэшВидовСубконто, ОбычныйЭтап);
	ОткрытьФорму("Справочник.ЭтапыУниверсальныхПроцессов.Форма.ФормаНастройкиУсловногоПерехода", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМатрицуПолномочий(Команда)
	
	ОбщегоНазначенияКлиентУХ.ПроверитьМодифицированность(ЭтаФорма, "ОткрытьМатрицуПолномочийВызов");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМатрицуПолномочийВызов() Экспорт
	
	ПараметрыФормы = ПолучитьСтруктуруОткрытияМатрицыПолномочий();
	ОткрытьФорму("Обработка.МатрицаПолномочий.Форма.ФормаУправленияМатрицейПолномочий", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОткрытияМатрицыПолномочий()
	
	РезультатФункции = Новый Структура;
	ОбъектБД_НастраиваемыйОтчет = Справочники.ДокументыБД.НайтиПоНаименованию("НастраиваемыйОтчет", , , Справочники.ТипыБазДанных.ТекущаяИБ);
	РезультатФункции.Вставить("ОбъектБД", ОбъектБД_НастраиваемыйОтчет);
	РезультатФункции.Вставить("ВерсияОрганизационнойСтруктуры", РегламентПоЭтапу(Объект.Ссылка));
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция РегламентПоЭтапу(Этап)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииРегламентовПодготовкиОтчетности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииРегламентовПодготовкиОтчетности КАК ВерсииРегламентовПодготовкиОтчетности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыУниверсальныхПроцессов КАК ЭтапыУниверсальныхПроцессов
		|		ПО ВерсииРегламентовПодготовкиОтчетности.ШаблонПроцесса = ЭтапыУниверсальныхПроцессов.Владелец
		|ГДЕ
		|	ЭтапыУниверсальныхПроцессов.Ссылка = &Этап";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура КритерийУтвержденияЭтапаПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

#Область ИндивидуальноеРасписание

&НаКлиенте
Процедура ДействиеПоРасписаниюПриИзменении(Элемент)

	ОбработатьИзменениеРасписания(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПоРасписаниюОчистка(Элемент, СтандартнаяОбработка)
	
	УдалитьРасписание(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписание(Команда)
	
	Если ПустаяСтрока(АдресХранилищаРасписания) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьРасписаниеПослеВопроса", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Будет создано индивидуальное регламентное задание для обработки этапа. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
	Иначе
		ОткрытьРасписаниеПослеВопроса(КодВозвратаДиалога.Да);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеПослеВопроса(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(АдресХранилищаРасписания) Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
	Иначе
		Расписание = ПолучитьИзВременногоХранилища(АдресХранилищаРасписания);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьРасписаниеПродолжение", ЭтаФорма);
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеПродолжение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		РасписаниеИзменено = Истина;
		ОбработатьИзменениеРасписания(Расписание);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасписание(Команда)

	Если НЕ ПустаяСтрока(АдресХранилищаРасписания) Тогда		
		ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьРасписаниеПослеВопроса", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Будет удалено индивидуальное регламентное задание для обработки этапа. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
	Иначе
		УдалитьРасписаниеПослеВопроса(КодВозвратаДиалога.Да);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасписаниеПослеВопроса(Результат, Параметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеИзменено = Истина;
	ОбработатьИзменениеРасписания(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРасписания(Расписание)
	
	Если ЗначениеЗаполнено(Объект.ДействиеПоРасписанию) Тогда
		Элементы.ОткрытьРасписание.Видимость = Истина;
	Иначе
		Расписание = Неопределено;
		Элементы.ОткрытьРасписание.Видимость = Ложь;
	КонецЕсли;
	
	Если Расписание = Неопределено Тогда
		Элементы.УдалитьРасписание.Видимость = Ложь;
		Если ЗначениеЗаполнено(АдресХранилищаРасписания) Тогда
			УдалитьИзВременногоХранилища(АдресХранилищаРасписания);
		КонецЕсли;
		АдресХранилищаРасписания = "";
		ПредставлениеРасписания = "";
	Иначе
		Элементы.УдалитьРасписание.Видимость = Истина;
		АдресХранилищаРасписания = ПоместитьВоВременноеХранилище(Расписание, ЭтаФорма.УникальныйИдентификатор);
		ПредставлениеРасписания = Строка(Расписание);
	КонецЕсли;
	
	Элементы.ПредставлениеРасписания.Видимость = НЕ ПустаяСтрока(ПредставлениеРасписания);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыФормируемыеДокументы

&НаКлиенте
Процедура ФормируемыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "ФормируемыеДокументыШаблонДокумента" Тогда
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументБД) Тогда
			ОграничитьТипКолонкиШаблона(Элемент.ТекущиеДанные.ДокументБД, СтандартнаяОбработка);
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ФормируемыеДокументыАналитики" Тогда
		
		Если Элемент.ТекущиеДанные.ЕстьАналитики Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Объект", Объект.Ссылка);
			ПараметрыОткрытия.Вставить("ШаблонДокумента", Элемент.ТекущиеДанные.ШаблонДокумента);
			ОткрытьФорму("РегистрСведений.ЗначенияАналитикОбъектов.ФормаСписка", ПараметрыОткрытия);
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормируемыеДокументыДокументБДПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФормируемыеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ПредупреждениеПоДокументуБД(ТекущиеДанные.ДокументБД);
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
	ТекущиеДанные.ШаблонДокумента = Неопределено;
	ОграничитьТипКолонкиШаблона(ТекущиеДанные.ДокументБД, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПредупреждениеПоДокументуБД(ДокументБД)
	
	ТекстСообщения = "";
	
	ИмяОбъектаМетаданных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБД, "ИмяОбъектаМетаданных");
	
	Если ИмяОбъектаМетаданных = "ТрансформационнаяКорректировка"
		И НЕ Константы.УчетПоСценариям.Получить() Тогда
		// Предупредим об изменении сценарии МСФО для документа Трансформационная корректировка, если флаг УчетПоСценариям не взведен
		ТекстСообщения = НСтр("ru = 'В системе не включен учет по сценариям. Сценарий документа Трансформационная корректировка будет изменен.'");
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаКлиенте
Процедура ФормируемыеДокументыШаблонДокументаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ФормируемыеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьАналитики = ЕстьАналитики(ТекущиеДанные.ШаблонДокумента);
	ТекущиеДанные.ЕстьАналитики = ЕстьАналитики;
	Если ЕстьАналитики Тогда
		ТекущиеДанные.Аналитики = "Настроить";
	Иначе
		Для Каждого СтрокаТаблицы Из Объект.ФормируемыеДокументы Цикл
			Если СтрокаТаблицы.ЕстьАналитики Тогда
				ЕстьАналитики = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ФормируемыеДокументыАналитики.Видимость = ЕстьАналитики;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.ФормируемыеДокументыКонтрольный.Видимость = 
		Объект.КритерийУтвержденияЭтапа = Перечисления.КритерииЗавершенияЭтапаПроцессаПодготовкиОтчетности.УтвержденыКонтрольныеДокументы;
		
КонецПроцедуры

&НаСервере
Процедура ОграничитьТипКолонкиШаблона(Значение, СтандартнаяОбработка)
	
	ДанныеДокументаБД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Значение, "ИмяОбъектаМетаданных, ИспользоватьШаблоны, РеквизитШаблонаДокумента");
	
	ТекущийОбъект = Метаданные.Документы.Найти(ДанныеДокументаБД.ИмяОбъектаМетаданных);
	Если ТекущийОбъект = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	Если ДанныеДокументаБД.ИспользоватьШаблоны И ЗначениеЗаполнено(ДанныеДокументаБД.РеквизитШаблонаДокумента) Тогда
		Элементы.ФормируемыеДокументыШаблонДокумента.ОграничениеТипа = ТекущийОбъект.Реквизиты[ДанныеДокументаБД.РеквизитШаблонаДокумента].Тип;
	Иначе
		Элементы.ФормируемыеДокументыШаблонДокумента.ОграничениеТипа = Новый ОписаниеТипов(Неопределено);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

 КонецПроцедуры

 &НаСервереБезКонтекста
Функция ЕстьАналитики(ШаблонДокумента)
	
	Если ТипЗнч(ШаблонДокумента) <> Тип("СправочникСсылка.ВидыОтчетов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ШаблонДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеВидаОтчета = БюджетированиеИОтчетностьПовтИсп.ДанныеВидаОтчета(ШаблонДокумента);
	
	Возврат ДанныеВидаОтчета.РазделениеПоПроектам ИЛИ ДанныеВидаОтчета.МаксКлючевыхАналитик <> 0;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАналитики()

	ЕстьАналитики = Ложь;
	Для Каждого СтрокаТаблицы Из Объект.ФормируемыеДокументы Цикл
		СтрокаТаблицы.ЕстьАналитики = ЕстьАналитики(СтрокаТаблицы.ШаблонДокумента);
		Если СтрокаТаблицы.ЕстьАналитики Тогда
			СтрокаТаблицы.Аналитики = "Настроить";
			ЕстьАналитики = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ФормируемыеДокументыАналитики.Видимость = ЕстьАналитики;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицыВоВременномХранилище(АдресДеревоОтборов, АдресТабличноеПолеПереходов, АдресКэшВидовСубконто, ОбычныйЭтап)
	
	АдресДеревоОтборов          = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ДеревоОтборов"), УникальныйИдентификатор);
	АдресТабличноеПолеПереходов = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ТабличноеПолеПерехода"), УникальныйИдентификатор);
	АдресКэшВидовСубконто       = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("КэшВидовСубконто"), УникальныйИдентификатор);
	ОбычныйЭтап = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиТаблицыИзВременногоХранилища(АдресХранилища)
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ДеревоПереходов = ПолучитьИзВременногоХранилища(АдресХранилища);
		УдалитьИзВременногоХранилища(АдресХранилища);
	ИначеЕсли ТипЗнч(АдресХранилища) = Тип("Структура") Тогда
		АдресПереходов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(АдресХранилища, "АдресПереходов", "");
		Если ЭтоАдресВременногоХранилища(АдресПереходов) Тогда
			ДеревоПереходов = ПолучитьИзВременногоХранилища(АдресПереходов);
		Иначе
			ДеревоПереходов = Неопределено;
		КонецЕсли;
	Иначе
		ДеревоПереходов = Неопределено;
	КонецЕсли;
	
	Если ДеревоПереходов <> Неопределено Тогда
		
		МассивУсловий = ДеревоПереходов.Строки.НайтиСтроки(Новый Структура("ЯвляетсяУсловием", 1), Истина);
		
		Объект.ЗначенияУсловийОтборов.Очистить();
		
		Для Каждого СтрУсловие ИЗ МассивУсловий Цикл
			
			Если ЗначениеЗаполнено(СтрУсловие.ЗначениеОтбора) Тогда
				
				Если ТипЗнч(СтрУсловие.ЗначениеОтбора)=Тип("СписокЗначений") Тогда
					
					Для Каждого УсловиеОтбора ИЗ СтрУсловие.ЗначениеОтбора Цикл
						
						ДобавитьЗначениеУсловия(УсловиеОтбора.Значение);
						
					КонецЦикла;
					
				Иначе
					
					ДобавитьЗначениеУсловия(СтрУсловие.ЗначениеОтбора);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоПереходов, "ТабличноеПолеПерехода");
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось получить дерево переходов'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеУсловия(ЗначениеУсловия)
	
	Если (НЕ ЗначениеЗаполнено(ЗначениеУсловия)) ИЛИ ОбщегоНазначенияУХ.ПримитивныйТип(ТипЗнч(ЗначениеУсловия))Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.ЗначенияУсловийОтборов.Добавить();
	НоваяСтрока.ЗначениеУсловия=ЗначениеУсловия;
	
КонецПроцедуры

#КонецОбласти
